       IDENTIFICATION DIVISION.
       PROGRAM-ID. CONDICIONAL-IFELSE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(4).
       01 NUM2 PIC 9(4).
       01 RESULTADO PIC 9(5).
       PROCEDURE DIVISION.
       PROCEDIMIENTO-PRINCIPAL.
           DISPLAY 'INTRODUCE EL PRIMER NUMERO'.
           ACCEPT NUM1.
           DISPLAY 'INTRODUCE EL SEGUNDO NUMERO'.
           ACCEPT NUM2.
           
           COMPUTE RESULTADO = NUM1 + NUM2.
           
           IF RESULTADO > 50
               DISPLAY 'EL RESULTADO ES MAYOR QUE 50.'
           ELSE
               DISPLAY 'EL RESULTADO ES MENOR O IGUAL QUE 50.'
           END-IF.
               
           STOP RUN.
       END PROGRAM CONDICIONAL-IFELSE.
