       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVISIONES.
       PROCEDURE DIVISION.
       PROCEDIMIENTO-PRINCIPAL.
           DISPLAY 'HOLA MUNDO'.
           STOP RUN.
       END PROGRAM DIVISIONES.