       IDENTIFICATION DIVISION.
       PROGRAM-ID. REFMOD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DATE PIC X(10) VALUE '19/09/2022'.
       01 WS-MM   PIC X(2).
       01 WS-DD   PIC X(2).
       01 WS-YYYY PIC X(4).
       PROCEDURE DIVISION.
       PROCEDIMIENTO-PRINCIPAL.
           DISPLAY 'LA FECHA ES ' WS-DATE.
           MOVE WS-DATE(1:2) TO WS-DD.
           DISPLAY 'EL DIA DE LA FECHA ES ' WS-DD.
           MOVE WS-DATE(4:2) TO WS-MM.
           DISPLAY 'EL MES DE LA FECHA ES ' WS-MM.
           MOVE WS-DATE(7:4) TO WS-YYYY.
           DISPLAY 'EL ANO DE LA FECHA ES ' WS-YYYY.
           STOP RUN.
       END PROGRAM REFMOD.
