       IDENTIFICATION DIVISION.
       PROGRAM-ID. CLAUSULA-RENAMES.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DESCRIPCION.
           05 WS-NUM.
               10 WS-NUM1  PIC 9(2) VALUE 11.
               10 WS-NUM2  PIC 9(2) VALUE 22.
           05 WS-CHAR.
               10 WS-CHAR1 PIC X(2) VALUE 'XX'.
               10 WS-CHAR2 PIC X(2) VALUE 'YY'.
           66 WS-RENAME RENAMES WS-NUM2 THRU WS-CHAR2.

       PROCEDURE DIVISION.
      *DEBE MOSTRAR EN PANTALLA 'WS-RENAME: 22XXYY'.
      *RENOMBRA DESDE WS-NUM2 HASTA WS-CHAR2.
           DISPLAY "WS-RENAME : " WS-RENAME.
           STOP RUN.
       END PROGRAM CLAUSULA-RENAMES.

