       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUMAR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(4).
       01 NUM2 PIC 9(4).
       01 RESULTADO PIC 9(6).
       PROCEDURE DIVISION.
       PROCEDIMIENTO-PRINCIPAL.
           DISPLAY "INTRODUCE EL PRIMER NUMERO:".
           ACCEPT NUM1.
           DISPLAY "INTRODUCE EL SEGUNDO NUMERO:".
           ACCEPT NUM2.
           ADD NUM1 TO NUM2 GIVING RESULTADO.
           DISPLAY "EL RESULTADO ES: " RESULTADO.
           STOP RUN.
       END PROGRAM SUMAR.
